# HasConstraint

## Description
Returns whether the referenced object has a parametric constraint .

```pascal
FUNCTION HasConstraint(h : HANDLE) : BOOLEAN;
```

```python

def vs.HasConstraint(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
Availability: from VectorWorks9.0
## Category
* Parametric Constraints